In [1]:
import numpy as np
from statsmodels.robust.scale import huber

In [2]:
import pandas as pd
import time,datetime

In [3]:
from statsmodels.robust.scale import qn,qn_scale

In [4]:
# Mean and standard deviation to generate normal random variates
mean, std_dev = 0, 2
sample_size = 25
np.random.seed(42)
x = np.random.normal(mean, std_dev, sample_size)
# Appends a couple of outliers
x = np.append(x, (50, 100))

In [5]:
x

array([  0.99342831,  -0.2765286 ,   1.29537708,   3.04605971,
        -0.46830675,  -0.46827391,   3.15842563,   1.53486946,
        -0.93894877,   1.08512009,  -0.92683539,  -0.93145951,
         0.48392454,  -3.82656049,  -3.44983567,  -1.12457506,
        -2.02566224,   0.62849467,  -1.81604815,  -2.8246074 ,
         2.93129754,  -0.4515526 ,   0.13505641,  -2.84949637,
        -1.08876545,  50.        , 100.        ])

In [6]:
print (np.mean(x), np.std(x))

5.2527628543368685 20.945734041764215

In [7]:
print(huber(x))

(array(-0.03323791), array(2.36742171))

In [8]:
print(qn_scale(x))

2.4281939407751443

In [9]:
y = huber(x)[0]

In [10]:
len(x)*y.item(0)

-0.8974235880007292

In [11]:
np.concatenate(([1,2,3], [4,5,6]), axis=0)

array([1, 2, 3, 4, 5, 6])

In [23]:
dfd =  pd.read_csv('/Users/smuel/Developer/Python/Louie7Predictors/sample_salesv3.csv')
dfd['date'] = pd.to_datetime(dfd['date'])

In [25]:
ar_data = dfd['date'].to_numpy()

In [27]:
dfd.head(5)

,Unnamed: 0,account number,name,sku,quantity,unit price,ext price,date
0,0,740150,BartonLLC,B1-20000,39,86.69,3380.91,2014-01-01 07:21:00
1,1,714466,BartonLLC,S2-77896,-1,63.16,-63.16,2014-01-01 07:21:30
2,2,218895,BartonLLC,B1-69924,23,90.70,2086.10,2014-01-01 07:22:00
3,3,307599,BartonLLC,B1-69924,41,21.05,863.05,2014-01-01 07:22:30
4,4,412290,Kassulke,S2-34077,6,83.21,499.26,2014-01-01 07:23:00

In [29]:
y = dfd.groupby(pd.Grouper(key='date', freq='D'))['unit price'].apply(lambda x : x.to_numpy())

In [30]:
type(y)

pandas.core.series.Series

In [32]:
ya = y.to_numpy()

In [33]:
ya[0]

array([86.69, 63.16, 90.7 , 21.05, 83.21, 87.63, 31.1 , 33.25, 84.09,
       81.92, 67.74, 20.26, 61.31, 12.44, 71.56, 71.51, 72.75, 16.23,
       94.3 , 31.18, 96.95, 50.29, 52.41, 16.97, 60.41])

In [34]:
len(dfd['date'])

41

In [41]:
np.abs(dfd['quantity'].max())

48

In [38]:
na = np.arange(0, dfd['quantity'].max() + 5 , 5)

In [39]:
na

array([ 0,  5, 10, 15, 20, 25, 30, 35, 40, 45, 50])

In [151]:
df3 =  pd.read_csv('/Users/smuel/Developer/Python/Louie7Predictors/sample_salesv3.csv')
df3['date'] = pd.to_datetime(df2['date'])

In [153]:
df3.head(5)

,Unnamed: 0,account number,name,sku,quantity,unit price,ext price,date
0,0,740150,BartonLLC,B1-20000,39,86.69,3380.91,2014-01-01 04:21:00
1,1,714466,BartonLLC,S2-77896,-1,63.16,-63.16,2014-01-01 04:21:30
2,2,218895,BartonLLC,B1-69924,23,90.70,2086.10,2014-01-01 05:22:00
3,3,307599,BartonLLC,B1-69924,41,21.05,863.05,2014-01-01 06:22:30
4,4,412290,Kassulke,S2-34077,6,83.21,499.26,2014-01-01 07:23:00

In [31]:
y1 = df1.groupby(pd.Grouper(key='date', freq='2H'))['unit price'].agg(sum)

In [32]:
type(y1)

pandas.core.series.Series

In [33]:
y1

date
2014-01-01 04:00:00    240.55
2014-01-01 06:00:00    191.89
2014-01-01 08:00:00    230.36
2014-01-01 10:00:00     88.00
2014-01-01 12:00:00    216.82
2014-01-01 14:00:00    183.28
2014-01-01 16:00:00    308.21
2014-01-01 18:00:00      0.00
2014-01-01 20:00:00      0.00
2014-01-01 22:00:00      0.00
2014-01-02 00:00:00      0.00
2014-01-02 02:00:00      0.00
2014-01-02 04:00:00      0.00
2014-01-02 06:00:00    180.72
2014-01-02 08:00:00      0.00
2014-01-02 10:00:00    218.07
2014-01-02 12:00:00     55.40
2014-01-02 14:00:00     43.40
2014-01-02 16:00:00      0.00
2014-01-02 18:00:00     73.04
2014-01-02 20:00:00    169.31
2014-01-02 22:00:00     69.36
Freq: 2H, Name: unit price, dtype: float64

In [38]:
l0 = y1.values

In [40]:
train , test = l0[0:len(l0-3)] , l0[len(l0-3):]

In [41]:
train

array([240.55, 191.89, 230.36,  88.  , 216.82, 183.28, 308.21,   0.  ,
         0.  ,   0.  ,   0.  ,   0.  ,   0.  , 180.72,   0.  , 218.07,
        55.4 ,  43.4 ,   0.  ,  73.04, 169.31,  69.36])

In [221]:
y2 = y1.resample('D').apply(lambda x : x.to_numpy()).to_numpy()

In [206]:
type(y1)

pandas.core.series.Series

In [222]:
y2

array([array([240.55, 191.89, 230.36,  88.  , 216.82, 183.28, 308.21,   0.  ,
         0.  ,   0.  ]),
       array([  0.  ,   0.  ,   0.  , 180.72,   0.  , 218.07,  55.4 ,  43.4 ,
         0.  ,  73.04, 169.31,  69.36])], dtype=object)

In [223]:
y2.size

2

In [233]:
y2[0] = np.pad(y2[0], (2, 0), 'constant')

In [234]:
len(y2[0])

12

In [235]:
y2[0].size

12

In [210]:
df2.head(5)

,Unnamed: 0,account number,name,sku,quantity,unit price,ext price,date
0,0,740150,BartonLLC,B1-20000,39,86.69,3380.91,2014-01-01 04:21:00
1,1,714466,BartonLLC,S2-77896,-1,63.16,-63.16,2014-01-01 04:21:30
2,2,218895,BartonLLC,B1-69924,23,90.70,2086.10,2014-01-01 05:22:00
3,3,307599,BartonLLC,B1-69924,41,21.05,863.05,2014-01-01 06:22:30
4,4,412290,Kassulke,S2-34077,6,83.21,499.26,2014-01-01 07:23:00

In [154]:
x  = pd.Timestamp(df2['date'][0])

In [183]:
idx = len(df2['date'])

In [184]:
idx

41

In [155]:
x

Timestamp('2014-01-01 04:21:00')

In [178]:
y  = pd.Timestamp(df2['date'][idx-1])

In [179]:
y

Timestamp('2014-01-02 23:41:00')

In [180]:
z = (y-x)

In [185]:
z1 = (y-x).to_pytimedelta().days

In [186]:
z1

1

In [236]:
z = np.stack(y2, axis=0)

In [237]:
z

array([[  0.  ,   0.  , 240.55, 191.89, 230.36,  88.  , 216.82, 183.28,
        308.21,   0.  ,   0.  ,   0.  ],
       [  0.  ,   0.  ,   0.  , 180.72,   0.  , 218.07,  55.4 ,  43.4 ,
          0.  ,  73.04, 169.31,  69.36]])

In [238]:
z.shape

(2, 12)

In [240]:
z1 = z[:,3]

In [241]:
np.mean(z1)

186.305

In [242]:
np.std(z1)

5.584999999999994

In [16]:
df1 =  pd.read_csv('/Users/smuel/Developer/Python/Louie7Predictors/sample_salesv3.csv')
df1['date'] = pd.to_datetime(df1['date'])

In [17]:
df1.head(5)

,Unnamed: 0,account number,name,sku,quantity,unit price,ext price,date
0,0,740150,BartonLLC,B1-20000,39,86.69,3380.91,2014-01-01 04:21:00
1,1,714466,BartonLLC,S2-77896,-1,63.16,-63.16,2014-01-01 04:21:30
2,2,218895,BartonLLC,B1-69924,23,90.70,2086.10,2014-01-01 05:22:00
3,3,740150,BartonLLC,B1-69924,41,21.05,863.05,2014-01-01 06:22:30
4,4,412290,Kassulke,S2-34077,6,83.21,499.26,2014-01-01 07:23:00